
       01 sqs-op-res-displ.
          05 sqs-op-err-msg PIC X(24)
             VALUE "ERROR ON SQS OPERATION: ".
          05 sqs-op-result-as-str PIC X(2).
          
